/*:
 ![Make School Banner](./swift_banner.png)
 # オブジェクト指向プログラミング: はじめに
 
 このチュートリアルでは、Swiftのオブジェクト指向プログラミングについて学びます。オブジェクト指向プログラミングとは何でしょうか？ データを格納する「オブジェクト」という概念と、これらのデータに対する演算を実行するメソッドに基づいたプログラミング パラダイムです。
 
 かなり漠然としていますね。でもご心配なく！Swiftについて既に知っていること、つまり関数や変数などから始めて、そこからオブジェクト指向プログラムを作っていきます。コースを通じて触れてきましたが、ようやく取り組む時が来ました！
 
 - callout(課題): 最初に`name`という引数を持つ`sleep`という関数を作成します。この関数は呼び出されるたびに`<name>は8時間眠ります`と出力します。必ずこの通りの書式で出力するようにしてください。
 
 次の関数の呼び出し:
 
     sleep(name: "Tigger")
 
 これは、次を出力します。
 
     Tiggerは8時間眠ります
 
 コードをチェックするには、`command+shift+y`を押すとコンソールが表示されます。そちらに出力されます！
 
 */

func sleep(name: String) {

}

sleep(name: "Tigger")

/*:
 - note: 作業が済んだら、完成したsleep関数の中身をコピーして次のセクションに進みましょう。
 */

//: [次へ](@next)
